## Pandas is an open source,BSD licensed library producing high performance easy to use data structures and data analysis tools for the python programming language.


### Pandas deals with following three data structures:
#### Series 
### Data Frame
### Panel

## Data Frame
### It is a two dimensional array with heterogenous data.DF are size mutable and data mutable.

In [2]:
# Lets create a data frame
## Basic DF --> Empty Df
## import pandas libraray as pandas and alising as pd
import pandas as pd
df=pd.DataFrame()

In [3]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [5]:
# Create DF from list.
data=[1,2,3,4,5]
df=pd.DataFrame(data)
print(df)

   0
0  1
1  2
2  3
3  4
4  5

In [9]:
import pandas as pd
data=[['Suresh',12],['Ram',20],['Tom',30]]
df=pd.DataFrame(data,columns=['Name','Age'])
print(df)

     Name  Age
0  Suresh   12
1     Ram   20
2     Tom   30

In [11]:
#Creatind DF from dict of ndarray/List
import pandas as pd
data={'Name':['Suresh','Ram','TOm'],'Age':[12,20,30]}
df=pd.DataFrame(data)
print(df)

     Name  Age
0  Suresh   12
1     Ram   20
2     TOm   30

In [12]:
data={'Name':['Ram','Shyam','Suresh'],'Age':[10,20,30]}
df=pd.DataFrame(data,index=['Rank1','Rank2','Rank3'])
print(df)

         Name  Age
Rank1     Ram   10
Rank2   Shyam   20
Rank3  Suresh   30

In [13]:
#create DF from list of Dict
data=[{'a':1,'b':2},{'a':5,'b':10,'c':9}]
df=pd.DataFrame(data)
print(df)

   a   b    c
0  1   2  NaN
1  5  10  9.0

In [19]:
#create Df from the list of series
import pandas as pd
d ={'one':pd.Series([1,2,3],index=['a','b','c']),'two':pd.Series([1,2,3,4],index=['a','b','c','d'])}
df=pd.DataFrame(d)
print(df['one'])

a    1.0
b    2.0
c    3.0
d    NaN
Name: one, dtype: float64

In [20]:
print(df)

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [1]:
import pandas as pd 
import numpy as np
#Playing with Data frame
df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['ROW1','ROW2','ROW3','ROW4','ROW5'],columns=['COLUMN1','COLUMN2','COLUMN3','COLUMN4'])
print(df)

      COLUMN1  COLUMN2  COLUMN3  COLUMN4
ROW1        0        1        2        3
ROW2        4        5        6        7
ROW3        8        9       10       11
ROW4       12       13       14       15
ROW5       16       17       18       19

In [2]:
df.to_csv('Test1.csv')

In [3]:
df.loc['ROW1'] # acessing the elements 1. loc 2. iloc

COLUMN1    0
COLUMN2    1
COLUMN3    2
COLUMN4    3
Name: ROW1, dtype: int32

In [4]:
#Check the type
type(df.loc['ROW1'])

pandas.core.series.Series

In [5]:
df.iloc[:,:]

      COLUMN1  COLUMN2  COLUMN3  COLUMN4
ROW1        0        1        2        3
ROW2        4        5        6        7
ROW3        8        9       10       11
ROW4       12       13       14       15
ROW5       16       17       18       19

In [6]:
df.iloc[0:2,0:2]

      COLUMN1  COLUMN2
ROW1        0        1
ROW2        4        5

### Grouping Data

In [1]:
import pandas as pd

In [2]:
# create dictionary of employee data and convert it to df
data = {'Name': ['Ram','Raghav','Madhav','Mukul','Rohit'],
       'Age':[20,30,35,25,21],
       'City':['Nagpur','Pune','Mumbai','Agra','Nashik'],
       'Qualification':['CA','B.E','MTECH','B.SC','CS']}
df1 = pd.DataFrame(data)
print(df1)

     Name  Age    City Qualification
0     Ram   20  Nagpur            CA
1  Raghav   30    Pune           B.E
2  Madhav   35  Mumbai         MTECH
3   Mukul   25    Agra          B.SC
4   Rohit   21  Nashik            CS

In [3]:
#Now we group a data of Name using groupby() function.
#Using groupby function with one key
df1.groupby('Name')

In [4]:
print(df1.groupby('Name').groups)

{'Madhav': Int64Index([2], dtype='int64'), 'Mukul': Int64Index([3], dtype='int64'), 'Raghav': Int64Index([1], dtype='int64'), 'Ram': Int64Index([0], dtype='int64'), 'Rohit': Int64Index([4], dtype='int64')}

In [6]:
data1 = {'Name': ['Mayuri','Manjiri','Rucha','Sanvi','Mona'],
       'Age':[20,30,35,25,21],
       'City':['Nagpur','Pune','Mumbai','Agra','Nashik'],
       'Qualification':['B.COM','B.E','M.COM','B.SC','CS']}
df2 = pd.DataFrame(data1)
print(df2)

      Name  Age    City Qualification
0   Mayuri   20  Nagpur         B.COM
1  Manjiri   30    Pune           B.E
2    Rucha   35  Mumbai         M.COM
3    Sanvi   25    Agra          B.SC
4     Mona   21  Nashik            CS

In [8]:
df2 = pd.DataFrame(data1,index=['5','6','7','8','9'])
frames = [df1,df2]
d1 = pd.concat(frames)
d1

      Name  Age    City Qualification
0      Ram   20  Nagpur            CA
1   Raghav   30    Pune           B.E
2   Madhav   35  Mumbai         MTECH
3    Mukul   25    Agra          B.SC
4    Rohit   21  Nashik            CS
5   Mayuri   20  Nagpur         B.COM
6  Manjiri   30    Pune           B.E
7    Rucha   35  Mumbai         M.COM
8    Sanvi   25    Agra          B.SC
9     Mona   21  Nashik            CS